# ---------
"""
Умова: Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. Програма повинна виводити одне з чисел:
3 (якщо всі числа однакові), 2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).

Вхідні дані: 3 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести ціле число
"""

# number1,number2,nember3 - цілі числа
number1 = int(input())
number2 = int(input())
number3 = int(input())
# визначеня кількості однакових чисел
if (number1 == number2) and (number2 == number3):
    print(3)
elif (number1 == number2) or (number2 == number3) or (number1 == number3):
    print(2)
else:
    print(0)
