# ---------
"""
Петя перейшов в іншу школу. На уроці фізкультури йому знадобилося визначити своє місце в строю. Допоможіть йому це зробити.

Програма отримує на вхід незростаючу послідовність натуральних чисел, що означають зріст кожної людини в строю. Після
цього вводиться число X - зріст Петі. Усі числа у вхідних даних натуральні і не перевищують 200.

Виведіть номер, під яким Петя повинен стати до строю. Якщо в строю є люди з однаковим зростом, таким же, як у Петі, то
він повинен встати після них.
"""

text = input() #вводимо дані
text1 = text.split() #розділяємо текст
height = input() #вводимо дані
text1.append(height) #добавляємо елемент
text1.sort() #сортуємо дані
text1.reverse() #перевертаємо дані
k = text1.count(height)
print(text1.index(height)+k) #виводимо дані
input()
