# -------
"""
Умова: Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним. Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".

Рік високосний, якщо виконується хоча б одна з умов:

рік завжди високосним, якщо його номер ділиться на 4 без остачі і не ділиться без остачі на 100
рік завжди високосним, якщо його номер ділиться на 400 без остачі

Вхідні дані: ціле число, що вводить користувач

Вихідні дані: вивести текстовий рядок.
"""

# date - заданий рік
date=int(input())
# перевірка на високосність
if (date%4==0 and date%100!=0):
    print("LEAP")
elif (date%400==0):
    print("LEAP")
else: print("COMMON")
