# -------
"""
Відомо, що на дошці 8 × 8 можна розставити 8 ферзів (королев) так, щоб вони не били один одного. Вам дана розстановка
8 ферзів на дошці, визначте, чи є серед них пара, що б'ють один одного.

Програма отримує на вхід вісім пар чисел, кожне число від 1 до 8 - координати 8 ферзів. Якщо ферзі не б'ють один одного,
виведіть слово NO, інакше виведіть YES.
"""

import math #імпортуємо клас mаth
a = [[0 for i in range(2)]for j in range(7)]
for i in range(7):       
    x, y = [int(i) - 1 for i in input().split()] #віднімаєм одиницю так як індексація розпочинається з 0
    a[i][0] = x
    a[i][1] = y
for i in range(7): #фіксую кординату і порівню її з всіма іншими
    for j in range(7):
        if i != j: #виключаю випадки коли кордината дорівнює сама собі
            if a[i][0] == a[j][0] or a[i][1] == a[j][1] or math.fabs(a[i][0] - a[j][0]) == math.fabs(a[i][1] - a[j][1]):#перевіряю чи є точки з однаковими х і у або різниця кординат однокова
                print('Queen beats Queen?\nYes')
                exit()
print('Queen beats Queen?\nNo')
input()
