# ------
"""
Умова: Вивести результат функції sign(x), що визначається наступним чином:
sign(x) = 1, if x > 0,
sign(x) = -1, if x < 0,
sign(x) = 0, if x = 0..

Вхідні дані: користувач вводить дійсне число.

Вихідні дані: вивести результат sign.
"""

x=float(input())
# x число для перевірки
# перевірка на число додатнє
if x > 0:
    print("sign(x) = 1")
# перевірка на чило відємне
elif x < 0:
    print("sign(x) = -1")
# перевірка чи дорівнює 0
elif x==0:
    print("sign(x) = 0")

