# -------
"""
Умова: Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин. Дано
координати двох клітин шахової дошки. Визначити, чи може королева перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два
числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в
іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
"""

# Координати почадку ходу
x1 = int(input())
y1 = int(input())
# Координати закінчення ходу
x2 = int(input())
y2 = int(input())
# Перевірка можливості
if x2 - x1 == y2 - y1:
    print("YES")
elif x2 - x1 == y1 - y2:
    print("YES")
elif (x1 == x2) or (y1 == y2):
    print("YES")
else: print("NO")
